site.org
#
# The gh-pages site at 'https://j-keck.github.io/reno
# are generated from this file

#
#+title: reno - reading notes extractor
#+hugo_base_dir: ./doc/site
#+options: creator:t author:nil

* Index
:PROPERTIES:
:export_title: reno
:export_file_name: _index
:export_hugo_section: /
:export_hugo_weight: 10
:export_hugo_type: docs
:END:

~reno~ extracts highlighted text from your pdf in an org-file.

The highlighted text be placed in a ~#+BEGIN_QUOTE~ / ~#+END_QUOTE~ block
and a drawer with the id's from extracted text.

You can later run an update and ~reno~ will recognize the exported blocks and
don't export it a second time / insert new highlighted text in right position.

Other text, headings, quotes and src blocks will keep intact.


{{< hint info >}}
More documentation / examples later.
{{< /hint >}}

